#include <stdio.h>
int main()
{
  int arr[] = {10, 20, 30, 40, 50};
  int *ptr = &arr[0]; // 声明一个int*类型的指针变量,指向数组中第一个元素的内存地址
  // 遍历数组,使用的是移动指针指向的方式
  for (int i = 0; i < 5; i++)
  {
    // printf("每个元素值:%d,每个元素的内存地址:%p\n",arr[i],&arr[i]);
    printf("每个元素值:%d,每个元素的内存地址:%p\n", *ptr, ptr);
    ptr++;
  }
  printf("\n=====================\n");
  // printf("ptr指向的内存地址:%p\n,内存空间中对应的数据是:%d\n",ptr,*ptr);
  // 此时此刻倒序输出数组,还是用移动指向变量指向的方式
  for (int i = 0; i < 5; i++)
  {
    ptr--;
    printf("每个元素值:%d,每个元素的内存地址:%p\n", *ptr, ptr);
  }
  // 指针自增和自减:指的是指针变量自身可以自增和自减,自身的内存地址发生了变化,指向也发生了变化
  // 指针加减整数:指的是指针变量可以加减整数,自身的内存地址没有发生变化,指向发生了变化

  // int num = 10;
  // num++; // 变了
  // num + 1; // 没变

  return 0;
}