#include <stdio.h>
int main()
{
  // 自增和自减
  // 自增符号: ++
  // 前自增(++x)和后自增(x++)
  // 后自增: x++;在参与运算的时候,先取出值,进行运算,再自身加1
  // 前自增: ++x;在参与运算的时候,先加1,然后再进行运算

  // 自减符号: --
  // 前自减(--x)和后自减(x--)
  // 后自减:x--;在参与运算的时候,先取出值,进行运算,再自身减1
  // 前自减:--x;在参与运算的时候,先减1,然后再进行运算

  // 自增的演示
  // int x = 10;
  // // int y = x++; // 先取值运算,后加1
  // //  printf("x=%d,y=%d\n", x, y); // 11 10
  // int y = ++x;
  // printf("x=%d,y=%d\n", x, y); // 11 11

  // 自减的演示
  // int x = 10;
  // // int y = x--;                 //
  // // printf("x=%d,y=%d\n", x, y); // 9 10
  // int y = --x;
  // printf("x=%d,y=%d\n", x, y); // 9 9

  // 练一下
  // int x = 10;
  // int y = x-- + --x + x++;
  // // 10 + 8+ 8
  // printf("%d \n",y);

  int x = 10;
  int y = (--x)- (--x); //  有问题
  // int y = (--x)- (++x); //  有问题
  printf("%d\n", y);
  // printf("%d\n", x);
  return 0;
}