#include <stdio.h>
int main()
{
  // 位运算

  // 按位与 : 都为1,则结果为1,否则为0
  {
    int x = 3, y = 2;
    // 3二进制: 0000 0011
    // 2二进制: 0000 0010
    // 结果   : 0000 0010
    printf("按位与运算符 & 的表达式:x&y 结果:%d \n", x & y);
  }
  // 按位或  : 有1则结果为1,否则为0
  {
    int x = 3, y = 2;
    // 3二进制: 0000 0011
    // 2二进制: 0000 0010
    // 结果   : 0000 0011
    printf("按位或运算符 | 的表达式:x|y 结果:%d \n", x | y);
  }
  // 按位异或 相同则为0,不同则为1
  {
    int x = 3, y = 2;
    // 3二进制: 0000 0011
    // 2二进制: 0000 0010
    // 结果   : 0000 0001
    printf("按位异或运算符 ^ 的表达式:x^y 结果:%d \n", x ^ y);
  }
  // 按位取反 :每一位取反,0变成1,1变成0
  {
    int x = 3, y = 2;
    // 2二进制: 0000 0010
    //          1111 1101   补码
    //          1111 1100   反码
    //          1000 0011   原码 
    printf("按位取反运算符 ~ 的表达式:~y 结果:%d \n", ~y);
  }
  // 按位左移
  {
    int x = 3, y = 2;
    printf("按位左移运算符 << 的表达式:x<<y 结果:%d \n", x << y);
  }
  // 按位右移
  {
    int x = 3, y = 2;
    printf("按位右移运算符 >> 的表达式:x>>y 结果:%d \n", x >> y);
  }
  {
    // 按位取反
    int x = 3;
    // 0000 0011
    // 1111 1100 补码
    // 1111 1011 反码
    // 1000 0100 原码 
     printf("按位取反运算符 ~ 的表达式:~x 结果:%d \n", ~x);
  }

  return 0;
}