#include <stdio.h>
int main()
{
  // 赋值运算符:
  // = 赋值运算符
  // += 例子: x+=2; 展开: x = x+2;

  // 赋值符号: =
  {
    int x = 10;
    printf("赋值符号 = 的表达式: x = 20的结果:%d \n", x = 20);
  }
  printf("\n==================\n");
  // 相加赋值符号: +=
  {
    int x = 10, y = 20;
    printf("相加赋值符号 += 的表达式: x+=y的结果:%d \n", x += y);
  }
  printf("\n==================\n");
  // 相减赋值符号: -=
  {
    int x = 10, y = 20;
    printf("相加赋值符号 -= 的表达式: x-=y的结果:%d \n", x -= y);
  }

  printf("\n==================\n");
  // 相乘赋值符号: *=
  {
    int x = 10, y = 20;
    printf("相乘赋值符号 *= 的表达式: x*=y的结果:%d \n", x *= y);
  }

  printf("\n==================\n");
  // 相除赋值符号: /=
  {
    int x = 10, y = 5;
    printf("相除赋值符号 /= 的表达式: x/=y的结果:%d \n", x /= y);
  }

  printf("\n==================\n");
  // 取余赋值符号: %=
  {
    int x = 10, y = 3;
    printf("取余赋值符号 %= 的表达式: x%=y的结果:%d \n", x %= y);
  }

  printf("\n==================\n");
  // 左移赋值符号: <<=
  {
    int x = 3, y = 2;
    // 3的二进制: 0000 0011
    //           0000 1100
    printf("左移赋值符号 <<= 的表达式: x<<=y的结果:%d \n", x <<= y);
  }

  // 右移赋值符号: >>=
  {
    // int x = 16, y = 2;
    // // 16的二进制: 0001 0000
    // //            0000 0100
    int x = 13, y = 2;
    // 13的二进制: 0000 1101
    //            000000 11
    // 13/4
    printf("右移赋值符号 >>= 的表达式: x>>=y的结果:%d \n", x >>= y);
  }

  // 按位与赋值符号: &=
  {
    int x = 3, y = 2; // x&=y 展开: x = x&y
    // 3的二进制: 0000 0011
    // 2的二进制: 0000 0010
    // -----------------------
    // 结果:      0000 0010
    printf("按位与赋值符号 &= 的表达式: x&=y的结果:%d \n", x &= y);
  }

  // 按位异或赋值符号: ^=
  {
    int x = 3, y = 2;
    // 3的二进制: 0000 0011
    // 2的二进制: 0000 0010
    // -----------------------
    // 结果:      0000 0001
    printf("按位异或赋值符号 ^= 的表达式: x^=y的结果:%d \n", x ^= y);
  }

  // 按位或赋值符号: |=
  {
    int x = 3, y = 2;
    // 3的二进制: 0000 0011
    // 2的二进制: 0000 0010
    // -----------------------
    // 结果:      0000 0011
    printf("按位或赋值符号 |= 的表达式: x|=y的结果:%d \n", x |= y);
  }
  return 0;
}