#include <stdio.h>
int main()
{
  // 字符数组:就是一个数组,只不过里面存储的每个数据是一个字符
  // 因为字符数组中存储了很多的字符,那么多的字符放在一个容器中,所以,可以看成是字符串
  // 方式1:定义字符数组,设定长度,并初始化数据,手动设定结束符\0
  // char chs1[5] = {'a', 'b', 'c', 'd', '\0'};
  // // printf("%s\n",chs1); // 字符数组可以看成是字符串,所以,可以使用%s占位符
  // for (int i = 0; i < 5;i++){
  //   printf("%c\n",chs1[i]);
  // }
  // 方式2:定义字符数组,设定长度,并初始化数据,不设定结束符\0,自动在字符数组的默认设定结束符\0
  // char chs2[5] = {'a', 'b', 'c', 'd'};
  // printf("%s\n",chs2);
  // 方式3:定义字符数组,没有设置设定长度,同时也没有设定结束符\0
  // char chs3[] = {'a','b','c'};
  // printf("%s\n",chs3);
  // 定义字符数组的简化写法1:没有设定长度,没有设置结束符\0
  char chs4[] = {"abcdef"};
  printf("%s\n",chs4);
  // 定义字符数组的简化写法2:没有设定长度,省略大括号
  char chs5[] = "hello";
  printf("%s\n",chs5);

  return 0;
}