#include <stdio.h>
int main()
{
  // 多维数组:数组中每个元素,还是数组,这种数组,我们一般理解为二维数组

  // int arr[] = {10,20,30,40,50};
  // for (int i = 0; i < 5;i++){
  //   printf("%d===%p\n",arr[i],&arr[i]);
  // }

  // 定义二维数组的方式1:先声明,后赋值
  // int nums[3][2]; // 二维数组的类型:int[3][2]
  // // 存储数据,通过索引(行和列)的方式来设定数据
  // nums[0][0] = 10;
  // nums[0][1] = 20;
  // nums[1][0] = 30;
  // nums[1][1] = 40;
  // nums[2][0] = 50;
  // nums[2][1] = 60;

  // 定义二维数组的方式2:直接定义二维数组的同时直接进行初始化
  // int nums2[3][2] = {
  //   {10,20},
  //   {30,40},
  //   {50,60}
  // };
  // 定义二维数组的方式3:直接定义二维数组的同时,直接存储数据(采用一维数组的方式赋值)
  // int nums3[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
  // 定义二维数组的方式4:没有行,直接设定列,直接初始化
  // int nums4[][3] = {1,2,3,4,5,6,7,8,9,10,11,12};

  // 嵌套循环的方式来遍历二维数组:双层的for

  // 二维数组
  int nums[3][4] = {
      {10, 20, 30, 40},
      {50, 60, 70, 80},
      {90, 100, 110, 120}};

  // printf("%zu\n",sizeof(nums)); // 二维数组的总字节数:48个
  // printf("%zu\n",sizeof(nums[0])); // 二维数组中第一个元素(第一行)的总字节数 16

  // 二维数组的行数
  int rows = sizeof(nums) / sizeof(nums[0]); // 行数
  // 二维数组的列数
  // int cols = sizeof(nums[0]) / sizeof(nums[0][0]);
  int cols = sizeof(nums[0]) / sizeof(int);

  // 遍历二维数组
  for (int i = 0; i < rows; i++)
  { // 行
    for (int j = 0; j < cols; j++)
    { // 列
      printf("%d ", nums[i][j]);
    }
    printf("\n");
  }

  return 0;
}