// 企业发放的奖金根据利润提成。

// 利润(I)低于或等于10万元时，奖金可提10%；
// 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
// 20万到40万之间时，高于20万元的部分，可提成5%；
// 40万到60万之间时高于40万元的部分，可提成3%；
// 60万到100万之间时，高于60万元的部分，可提成1.5%；
// 高于100万元时，超过100万元的部分按1%提成。
// 从键盘输入当月利润I，求应发放奖金总数？

#include <stdio.h>

int main()
{
    double i, j;
    printf("请输入当月利润： \n");
    scanf("%lf", &i);
    if (i <= 10)
    {
        j = i * 0.1;
    }
    else if (10 < i && i < 20)
    {
        j = (i - 10) * 0.075 + 10 * 0.1;
    }
    else if (20 < i && i < 40)
    {
        j = (i - 20) * 0.05 + (i - 10) * 0.075 + 10 * 0.1;
    }
    else if (40 < i && i < 60)
    {
        j = (i - 40) * 0.03 + (i - 20) * 0.05 + (i - 10) * 0.075 + 10 * 0.1;
    }
    else if (60 < i && i < 100)
    {
        j = (i - 60) * 0.015 + (i - 40) * 0.03 + (i - 20) * 0.05 + (i - 10) * 0.075 + 10 * 0.1;
    }
    else
    {
        j = (i - 100) * 0.01 + (i - 60) * 0.015 + (i - 40) * 0.03 + (i - 20) * 0.05 + (i - 10) * 0.075 + 10 * 0.1;
    }
    printf("%lf \n",j);

    return 0;
}