#include <stdio.h>

// 输入两个正整数m和n，求其最大公约数和最小公倍数。
// 辗转相除法‌：用较大的数除以较小的数，再用出现的余数去除前面的除数，如此反复，直到余数为0，最后的除数即为最大公约数。例如，求12和18的最大公约数，18÷12=1…6，12÷6=2…0，所以最大公约数为6。
// 利用两个数的乘积等于这两个数的最大公约数与最小公倍数的积的公式 公倍数最小
// n*m = a*b

int main()
{
    int n, m, x, i = 1;
    printf("请输入两个正整数： \n");
    scanf("%d,%d", &n, &m);
    if (n > m)
    {
        x = n % m;
        if (m % x == 0)
        {
            printf("最大公约数为:%d \n", x);
        }
        else
        {
            printf("最大公约数为:%d \n", i);
        }
    }
    else
    {
        x = m % n;
        if (n % x == 0)
        {
            printf("最大公约数为:%d \n", x);
        }
        else
        {
            printf("最大公约数为:%d \n", i);
        }
    }

    printf("最小公倍数：%d \n", m * n / x);
    return 0;
}