#include <stdio.h>
int main()
{
  // for循环:也是循环中一种
  // for循环语句语法:
  /*
    for(表达式1;表达式2;表达式3){
      循环体语句4;
    }

    for循环语句执行过程:
      先执行一次表达式1,然后执行表达式2,然后执行循环语句,执行表达式3,再执行表达式2,再执行循环体语句,再执行表达式3,再执行表达式2,再执行循环体语句....

    for(int i=0;i<10;i++){
      printf("%d\n",i);
    }
    执行过程:
    先执行第一个表达式int i=0;然后判断第二个表达式i<10是否成立,如果不成立,则循环结束,如果成立,则执行for大括号中的循环语句,然后执行表达式3,再次执行第二个表达式i<10是否成立,如果成立则执行循环语句,否则跳出循环....
  例子:输出第n天吃了n个包子
  */
  // for (int i = 0; i < 10; i++)
  // {
  //   printf("第%d天吃了%d个包子\n", i, i);
  // }
  // printf("i的值为:%d",i);

  {
    // 循环输出7-15
    for (int i = 7; i <= 15; i++)
    {
      printf("%d\n", i);
    }
  }
  printf("\n============\n");
  {
    // 倒序输出56到43
    for (int i = 56; i >= 43; i--)
    {
      printf("%d\n", i);
    }
  }
  printf("\n============\n");
  {
    // 输出10(包含10)以内的偶数
    // for (int i = 0; i <= 10;i++){
    //   if(i%2==0){
    //     printf("%d\n",i);
    //   }
    // }

    // 思路2:
    for (int i = 0; i <= 10; i += 2)
    {
      printf("%d\n", i);
    }
  }
  printf("\n============\n");
  {
    // 1-100之间所有数字的和
    int sum = 0;
    for (int i = 0; i <= 100; i++)
    {
      sum += i;
    }
    printf("和为:%d\n", sum);
  }

  printf("\n============\n");
  {  // 求10以内奇数的乘积
    int result = 1;
    for (int i = 1; i <= 10; i++)
    {
      // 判断
      if (i % 2 != 0)
      {
        result *= i;
      }
    }
    printf("乘积为:%d\n", result);
  }
  printf("\n============\n");
  {  // 不停的提示用户输入密码,如果不是123,则一直提示
    int pwd; // 用来存储密码的
    for (; pwd != 123;)
    {
      printf("输入密码:\n");
      scanf("%d", &pwd);
    }
  }

  printf("\n============\n");
  {
    // 死循环
    for (;;)
    {
      printf("啦啦啦\n");
    }
  }
  return 0;
}